In [1]:
a=100
b=200
a+b

300

In [3]:
print("hello world")

hello world

In [2]:
a=[1,2,3]
print(a)

[1, 2, 3]

# kitamura

aaa
-------

In [29]:
import numpy as np
import pandas as pd

s = pd.Series([1,3,4,np.nan,6,8],index=['a', 'b', 'c', 'd', 'e', 'f'])
s.name

In [8]:
d2 = pd.Series({'a':1})
d2

a    1
dtype: int64

In [17]:
s[s >= s.median()]

c    4.0
e    6.0
f    8.0
dtype: float64

In [20]:
s.to_numpy()

array([ 1.,  3.,  4., nan,  6.,  8.])

In [24]:
s[:-1]

a    1.0
b    3.0
c    4.0
d    NaN
e    6.0
dtype: float64

In [34]:
d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
    'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [36]:
data=[(1, 2., 'Hello'), (2, 3., "World")]
data

pd.DataFrame(data)

   0    1      2
0  1  2.0  Hello
1  2  3.0  World

In [38]:
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [41]:
df['flag']=df['one']>2
df

   one  two   flag
a  1.0  1.0  False
b  2.0  2.0  False
c  3.0  3.0   True
d  NaN  4.0  False

In [42]:
df['three'] = df['one']*df['two']
df

   one  two   flag  three
a  1.0  1.0  False    1.0
b  2.0  2.0  False    4.0
c  3.0  3.0   True    9.0
d  NaN  4.0  False    NaN

In [43]:
df['foo'] = 'bar'
df

   one  two   flag  three  foo
a  1.0  1.0  False    1.0  bar
b  2.0  2.0  False    4.0  bar
c  3.0  3.0   True    9.0  bar
d  NaN  4.0  False    NaN  bar

In [44]:
!pwd

/Users/kitamura